app/views/curate/index.erb


<% @about = About.first%>
<% @contact = Contact.first %>
<% @image = Curate.first %>
<% @curate = Gallery.find(@image.image) %>
---
SELECT  "abouts".* FROM "abouts" ORDER BY "abouts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "curates".* FROM "curates" ORDER BY "curates"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ?  [["id", 13]]

  <%= form_for @about, :method => "put" do |f| %>
  <%= f.select :image, options_from_collection_for_select(Gallery.all, :id, :title, @about.image) %>
---
SELECT  "galleries".* FROM "galleries" ORDER BY "galleries"."id" ASC LIMIT ?  [["LIMIT", 1]]