app/views/paintings/_paintings.erb

SELECT "galleries".* FROM "galleries" WHERE "galleries"."media_type" = ? LIMIT -1 OFFSET ?  [["media_type", "paint"], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "galleries" WHERE "galleries"."media_type" = ? LIMIT -1 OFFSET ?) subquery_for_count  [["media_type", "paint"], ["OFFSET", 0]]
---
 end  %>
<% paintings = Gallery.where(media_type:  'paint').offset((url * 9) -9)%>
<% paintings_total = Gallery.where(media_type:  'paint')%>