app/views/portraits/_portraits.erb

 end  %>
<% portraits = Gallery.where(media_type:  'portrait').offset((url * 9) -9)%>
<% portraits_total = Gallery.where(media_type:  'portrait')%>
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."media_type" = ? LIMIT -1 OFFSET ?  [["media_type", "portrait"], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "galleries" WHERE "galleries"."media_type" = ? LIMIT -1 OFFSET ?) subquery_for_count  [["media_type", "portrait"], ["OFFSET", 0]]