app/views/mixed_media/_mixed_media.erb

 end  %>
<% mixed_media = Gallery.where(media_type:  'mixed').offset((url * 9) -9)%>
<% mixed_media_total = Gallery.where(media_type:  'mixed')%>
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."media_type" = ? LIMIT -1 OFFSET ?  [["media_type", "price > 0"], ["OFFSET", -1]]
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "galleries" WHERE "galleries"."media_type" = ? LIMIT -1 OFFSET ?) subquery_for_count  [["media_type", "mixed"], ["OFFSET", 0]]