app/views/gallery/_homepage.erb

SELECT  "galleries".* FROM "galleries" WHERE (price > 0) ORDER BY "galleries"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "galleries" WHERE (price > 0)
---
 end  %>
<% gallery = Gallery.where('price > 0').first%>
<% gallery_total = Gallery.where('price > 0') %>