app/views/gallery/_slideshow.erb

 end  %>
<% gallery = Gallery.where('price > 0').offset((url * 9) -9)%>
---
SELECT "galleries".* FROM "galleries" WHERE (price > 0) LIMIT -1 OFFSET ?  [["OFFSET", 0]]


  <div id="pageindex"> viewing <%= count %> of <%= Gallery.count %><br>
---
SELECT  "galleries".* FROM "galleries" WHERE (price > 0) LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 1]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "galleries" WHERE (price > 0) LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 9], ["OFFSET", 1]]