app/controllers/about_controller.rb

UPDATE "abouts" SET "image" = ?, "updated_at" = ? WHERE "abouts"."id" = ?  [["image", "1"], ["updated_at", "2017-08-12 21:21:41.236002"], ["id", 1]]
---
  def update
    @about.update(
      image: "#{params[:about]['image']}",
      bio: "#{params[:about]['bio']}",
      statement: "#{params[:about]['statement']}"
      )

SELECT  "abouts".* FROM "abouts" ORDER BY "abouts"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def set_about
      @about = About.first