app/controllers/contact_controller.rb

  def update
    @contact.update(
      body: "#{params[:contact]['body']}",
      phone: "#{params[:contact]['phone']}",
      email: "#{params[:contact]['email']}"

      )
---
UPDATE "contacts" SET "body" = ?, "phone" = ?, "email" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["body", "updated contact form"], ["phone", "555-555-5566"], ["email", "updated@email.ca"], ["updated_at", "2017-08-10 23:29:15.010840"], ["id", 1]]

    def set_contact
      @contact = Contact.first
---
SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" ASC LIMIT ?  [["LIMIT", 1]]