app/controllers/curate_controller.rb

SELECT  "curates".* FROM "curates" ORDER BY "curates"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "curates" SET "image" = ?, "updated_at" = ? WHERE "curates"."id" = ?  [["image", "10"], ["updated_at", "2017-08-11 01:40:36.706074"], ["id", 1]]
---
  def update
    Curate.first.update(
      url: "#{params[:curate]['url']}"
     )

SELECT  "curates".* FROM "curates" ORDER BY "curates"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def set_curate
      @curate = Curate.first