app/controllers/gallery_controller.rb

  def update
    @curate.update(
      title: "#{params[:gallery]['title']}",
      media_type: "#{params[:gallery]['media_type']}",
      medium: "#{params[:gallery]['medium']}",
      price: "#{params[:gallery]['price']}",
      size: "#{params[:gallery]['size']}"
      )
---
UPDATE "galleries" SET "title" = ?, "media_type" = ?, "date" = ?, "price" = ?, "size" = ?, "updated_at" = ? WHERE "galleries"."id" = ?  [["title", "4"], ["media_type", ""], ["date", ""], ["price", ""], ["size", ""], ["updated_at", "2017-08-11 01:32:46.287461"], ["id", 1]]

    def set_curate
      @curate = Gallery.first
---
SELECT  "galleries".* FROM "galleries" WHERE (price > 0) ORDER BY "galleries"."id" ASC LIMIT ?  [["LIMIT", 1]]