app/controllers/mailer_controller.rb

SELECT  "mailers".* FROM "mailers" ORDER BY "mailers"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "mailers" SET "subject" = ?, "body" = ?, "updated_at" = ? WHERE "mailers"."id" = ?  [["subject", ""], ["body", ""], ["updated_at", "2017-08-11 13:47:25.040700"], ["id", 1]]
---
  def update
    Mailer.first.update(
      subject: "#{params[:mailer]['subject']}",
      body: "#{params[:mailer]['body']}"
      )