app/views/about/_about.erb

SELECT  "galleries".* FROM "galleries" ORDER BY "galleries"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    <div id="aboutimage">
          <%= image_tag "#{Gallery.first.title}.jpg"%>

SELECT  "abouts".* FROM "abouts" ORDER BY "abouts"."id" ASC LIMIT ?  [["LIMIT", 1]]
---

<div id='aboutbody'><%= About.first.body %></div>