app/views/contact/_contact.erb

<% @contact = Contact.first %>
<% @mail = Mailer.first%>
---
SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "mailers".* FROM "mailers" ORDER BY "mailers"."id" ASC LIMIT ?  [["LIMIT", 1]]